2023-02-21-shrove-tuesday.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.dasmith.xyz/rss.xml"
      title="RSS feed for https://www.dasmith.xyz/">
<title>Shrove Tuesday/Shrovetide</title>
<meta name="author" content="David Smith">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<link rel="apple-touch-icon-precomposed" href="static/favicon-152.png">
<link rel="msapplication-TitleImage" href="static/favicon-144.png">
<link rel="msapplication-TitleColor" href="#0141ff">
;;;; <link rel="stylesheet" href="static/katex.min.css">
;<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://www.dasmith.xyz">David's Ramblings</a>
  <div class="sitelinks">
    <a href="https://www.dasmith.xyz">Home</a> | <a href="https://www.dasmith.xyz/about.html">About</a>
  </div>
 </div></div>
<div id="content">
<div class="post-date">21 Feb 2023</div><h1 class="post-title"><a href="https://www.dasmith.xyz/2023-02-21-shrove-tuesday.html">Shrove Tuesday/Shrovetide</a></h1>
<p>
Shrove \Shrove\,
     imp. of {Shrive}.
     [1913 Webster]
</p>

<p>
{Shrove Sunday}, Quinguagesima Sunday.
</p>

<p>
{Shrove Tuesday}, the Tuesday following Quinguagesima Sunday,
   and preceding the first day of Lent, or Ash Wednesday.
</p>

<p>
Note: It was formerly customary in England, on this day, for
      the people to confess their sins to their parish
      priests, after which they dined on pancakes, or
      fritters, and the occasion became one of merriment. The
      bell rung on this day is popularly called Pancake Bell,
      and the day itself Pancake Tuesday. &#x2013;P. Cyc.
      [1913 Webster]
</p>

<p>
Shrive \Shrive\, v. t. [imp. {Shrived}or {Shrove}; p. p.
     {Shriven}or {Shrived}; p. pr. &amp; vb. n. {Shriving}.] [OE.
     shriven, schriven, AS. scr[imac]van to shrive, to impose
     penance or punishment; akin to OFries. skr[imac]va to impose
     punishment; cf. OS. biskr[imac]ban to be troubled. Cf.
     {Shrift}, {Shrovetide}.]
</p>
<ol class="org-ol">
<li><p>
To hear or receive the confession of; to administer
confession and absolution to; &#x2013; said of a priest as the
agent.
</p>

<p>
That they should shrive their parishioners. &#x2013;Piers
				      Plowman.
</p>

<p>
Doubtless he shrives this woman, . . .
Else ne&rsquo;er could he so long protract his speech.
				      &#x2013;Shak.
</p>

<p>
Till my guilty soul be shriven.       &#x2013;Longfellow.
</p></li>

<li><p>
To confess, and receive absolution; &#x2013; used reflexively.
</p>

<p>
Get you to the church and shrive yourself. &#x2013;Beau. &amp; Fl.
</p></li>
</ol>
<div class="taglist"><a href="https://www.dasmith.xyz/tags.html">Tags</a>: <a href="https://www.dasmith.xyz/tag-lent.html">Lent</a> </div></div>
<div id="postamble" class="status"><div id="archive">
  <a href="https://www.dasmith.xyz/archive.html">Other posts</a>
</div>
<center>David's Ramblings &#169; 2023 David Smith - Certified 100% AI-Free Content</center></div>
</body>
</html>
